# Introduction

In this lab, we will explore PySpark SQL, which is Sparkâ€™s high-level API for working with structured data. You will learn how to interact with PySparkSQL, using DataFrame API and SQL query.

Before you can use SQL in Spark, you will first need to create a temporary view. Creating a temporary view is performed by calling the createOrReplaceTempView()function on a DataFrame. Once created, pass any SQL statements in a call to spark.sql():

## Setting Up

Importing pyspark and pyspark's SQL API

In [1]:
import pyspark
from pyspark.sql import SparkSession

Initializing SparkSession

In [2]:
session = SparkSession.builder.appName('car_app').getOrCreate()
# DOCS 
# https://spark.apache.org/docs/2.1.0/api/python/pyspark.sql.html?highlight=sparksession#pyspark.sql.SparkSession

Reading the CSV File with Spark DataFrame API

In [3]:
cars = session.read.load('../spark_files/cars.csv', format='csv', header=True, inferSchema=True)  
# Note the read.load w/ (format='csv') kwarg, diff from pandas
print(type(cars))

cars.printSchema()  # schema placement looks kind of like YAML ðŸ”—

<class 'pyspark.sql.dataframe.DataFrame'>
root
 |-- Car: string (nullable = true)
 |-- MPG: double (nullable = true)
 |-- Cylinders: integer (nullable = true)
 |-- Displacement: double (nullable = true)
 |-- Horsepower: integer (nullable = true)
 |-- Weight: integer (nullable = true)
 |-- Acceleration: double (nullable = true)
 |-- Model: integer (nullable = true)
 |-- Origin: string (nullable = true)
 |-- quantity: integer (nullable = true)
 |-- city: string (nullable = true)

## Running SQl Queries

Using the createTempView() method.

In [10]:
cars.createTempView('temp_cars')  # temp view generated from cars dataframe
session.sql("""SELECT * from temp_cars""").show(10)  # sql query inside the established session
# note that we do not need to assign the temp view to a variable name

+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+-------+
|                 Car| MPG|Cylinders|Displacement|Horsepower|Weight|Acceleration|Model|Origin|quantity|   city|
+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+-------+
|AMC Ambassador Br...|13.0|        8|       360.0|       175|  3821|        11.0|   73|    US|      25|NewYork|
|  AMC Ambassador DPL|15.0|        8|       390.0|       190|  3850|         8.5|   70|    US|       2|     NJ|
|  AMC Ambassador SST|17.0|        8|       304.0|       150|  3672|        11.5|   72|    US|       4| DALLAS|
|         AMC Concord|19.4|        6|       232.0|        90|  3210|        17.2|   78|    US|      52|  TEXAS|
|         AMC Concord|24.3|        4|       151.0|        90|  3003|        20.1|   80|    US|      42|     OH|
|     AMC Concord d/l|18.1|        6|       258.0|       120|  3410|        15.1|   78|    US|       4|NewYork|
|      AMC Concord DL|23.0|        4|       151.0|         0|  3035|        20.5|   82|    US|      45|     NJ|
|    AMC Concord DL 6|20.2|        6|       232.0|        90|  3265|        18.2|   79|    US|     328| DALLAS|
|         AMC Gremlin|21.0|        6|       199.0|        90|  2648|        15.0|   70|    US|      68|  TEXAS|
|         AMC Gremlin|19.0|        6|       232.0|       100|  2634|        13.0|   71|    US|      78|     OH|
+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+-------+
only showing top 10 rows

Simple Aggrigation: Finding Total Quantity of Cars. 
SUM and GROUP BY

In [12]:
session.sql("""
SELECT car, sum(quantity) AS Total 
FROM temp_cars
GROUP BY car
""").show(10)  
# default show w/o input is 10 anyway
# note the AS total
# note sql is not case sensative so Car == car

+--------------------+-----+
|                 car|Total|
+--------------------+-----+
|Chevrolete Chevel...|  206|
|Volkswagen 1131 D...|   63|
|Chevrolet Monte C...|  582|
|     Ford LTD Landau|  331|
|       Honda Prelude|  400|
|      Chevrolet Nova|  608|
|   Volkswagen Rabbit| 1441|
|     Ford Torino 500|   81|
|        Toyota Camry|  153|
|         Audi 100 LS|   65|
+--------------------+-----+
only showing top 10 rows

Multiple Aggrigations: SUM and MAX

In [15]:
session.sql("""
SELECT 
    Car, 
    sum(quantity) AS Sum,
    max(quantity) AS Max
FROM temp_cars 
GROUP BY Car
ORDER BY Car
""").show()
# ðŸ‘€ diff cities have different amounts of cars in stock, so 
# the query is showing the sum of the total num of car quantities, 
# and the row with the max quantity

+--------------------+---+---+
|                 Car|Sum|Max|
+--------------------+---+---+
|AMC Ambassador Br...| 25| 25|
|  AMC Ambassador DPL|  2|  2|
|  AMC Ambassador SST|  4|  4|
|         AMC Concord| 94| 52|
|      AMC Concord DL| 45| 45|
|    AMC Concord DL 6|328|328|
|     AMC Concord d/l|  4|  4|
|         AMC Gremlin|512|214|
|          AMC Hornet|404|172|
|AMC Hornet Sporta...| 90| 90|
|         AMC Matador|833|234|
|    AMC Matador (sw)|302|185|
|           AMC Pacer|221|221|
|       AMC Pacer d/l| 75| 75|
|       AMC Rebel SST|  4|  4|
|  AMC Rebel SST (sw)| 53| 53|
|       AMC Spirit DL|575|575|
|         Audi 100 LS| 65| 65|
|          Audi 100LS|209|164|
|           Audi 4000|362|362|
+--------------------+---+---+
only showing top 20 rows

Count the number of *distinct* cities per car: COUNT and DISTINCT

In [19]:
session.sql("""
SELECT Car, count(DISTINCT city) AS `Number of Cities Located in`
FROM temp_cars
GROUP BY Car
""").show()

+--------------------+---------------------------+
|                 Car|Number of Cities Located in|
+--------------------+---------------------------+
|Chevrolete Chevel...|                          1|
|Volkswagen 1131 D...|                          1|
|Chevrolet Monte C...|                          2|
|     Ford LTD Landau|                          1|
|       Honda Prelude|                          1|
|      Chevrolet Nova|                          3|
|   Volkswagen Rabbit|                          5|
|     Ford Torino 500|                          1|
|        Toyota Camry|                          1|
|         Audi 100 LS|                          1|
|Plymouth Valiant ...|                          1|
|Toyota Corolla Ma...|                          1|
|Oldsmobile Cutlas...|                          1|
|Fiat 124 Sport Coupe|                          1|
|Chevrolet Caprice...|                          3|
|     Volvo 145e (sw)|                          1|
|    Chevrolet Camaro|                          1|
|            Audi Fox|                          1|
|       Dodge Aspen 6|                          1|
|    Pontiac Catalina|                          3|
+--------------------+---------------------------+
only showing top 20 rows

Find the Cars that have quantities greater than 200: WHERE Clause.

In [20]:
session.sql("""
SELECT * 
FROM temp_cars
WHERE quantity > 200 
ORDER BY quantity DESC;
""").show()

+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+------+
|                 Car| MPG|Cylinders|Displacement|Horsepower|Weight|Acceleration|Model|Origin|quantity|  city|
+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+------+
|   Plymouth Arrow GS|25.5|        4|       122.0|        96|  2300|        15.5|   77|    US|   75275|    OH|
|Buick Opel Isuzu ...|30.0|        4|       111.0|        80|  2155|        14.8|   77|    US|     814|    OH|
|      Toyota Mark II|19.0|        6|       156.0|       108|  2930|        15.5|   76| Japan|     757| TEXAS|
|Oldsmobile Cutlas...|17.0|        8|       260.0|       110|  4060|        19.0|   77|    US|     752|    NJ|
|       AMC Spirit DL|27.4|        4|       121.0|        80|  2670|        15.0|   79|    US|     575|    OH|
|     Ford Mustang GL|27.0|        4|       140.0|        86|  2790|        15.6|   82|    US|     439|    OH|
|    Chevrolet Camaro|27.0|        4|       151.0|        90|  2950|        17.3|   82|    US|     438| TEXAS|
|    Toyota Celica GT|32.0|        4|       144.0|        96|  2665|        13.9|   82| Japan|     436| TEXAS|
|Chrysler Lebaron ...|26.0|        4|       156.0|        92|  2585|        14.5|   82|    US|     434|DALLAS|
|Buick Century Lim...|25.0|        6|       181.0|       110|  2945|        16.4|   82|    US|     432|DALLAS|
|       Datsun 310 GX|38.0|        4|        91.0|        67|  1995|        16.2|   82| Japan|     431|    NJ|
|  Honda Civic (auto)|32.0|        4|        91.0|        67|  1965|        15.7|   82| Japan|     430| TEXAS|
|      Toyota Corolla|34.0|        4|       108.0|        70|  2245|        16.9|   82| Japan|     428|    NJ|
|        Honda Accord|36.0|        4|       107.0|        75|  2205|        14.5|   82| Japan|     427|    OH|
|      Mercury Lynx l|36.0|        4|        98.0|        70|  2125|        17.3|   82|    US|     425| TEXAS|
|Plymouth Horizon ...|38.0|        4|       105.0|        63|  2125|        14.7|   82|    US|     424|DALLAS|
|    Mazda GLC Custom|31.0|        4|        91.0|        68|  1970|        17.6|   82| Japan|     423| TEXAS|
|  Mazda GLC Custom l|37.0|        4|        91.0|        68|  2025|        18.2|   82| Japan|     422|    OH|
| Volkswagen Rabbit l|36.0|        4|       105.0|        74|  1980|        15.3|   82|Europe|     421|    NJ|
|Ford Fairmont Futura|24.0|        4|       140.0|        92|  2865|        16.4|   82|    US|     419|    NJ|
+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+------+
only showing top 20 rows

Find the cars that have a horsepower greater than the average:
SUB-QUERY in the WHERE Clause.

In [22]:
session.sql("""
SELECT * 
FROM temp_cars
WHERE Horsepower > (SELECT avg(Horsepower) FROM temp_cars);
""").show()
# 'where horsepower greater than average from same table'

+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+-------+
|                 Car| MPG|Cylinders|Displacement|Horsepower|Weight|Acceleration|Model|Origin|quantity|   city|
+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+-------+
|AMC Ambassador Br...|13.0|        8|       360.0|       175|  3821|        11.0|   73|    US|      25|NewYork|
|  AMC Ambassador DPL|15.0|        8|       390.0|       190|  3850|         8.5|   70|    US|       2|     NJ|
|  AMC Ambassador SST|17.0|        8|       304.0|       150|  3672|        11.5|   72|    US|       4| DALLAS|
|     AMC Concord d/l|18.1|        6|       258.0|       120|  3410|        15.1|   78|    US|       4|NewYork|
|AMC Hornet Sporta...|18.0|        6|       258.0|       110|  2962|        13.5|   71|    US|      90|     NJ|
|         AMC Matador|14.0|        8|       304.0|       150|  3672|        11.5|   73|    US|     131|  TEXAS|
|         AMC Matador|16.0|        6|       258.0|       110|  3632|        18.0|   74|    US|     179|NewYork|
|         AMC Matador|15.0|        6|       258.0|       110|  3730|        19.0|   75|    US|     207|     NJ|
|         AMC Matador|15.5|        8|       304.0|       120|  3962|        13.9|   76|    US|     234| DALLAS|
|    AMC Matador (sw)|15.0|        8|       304.0|       150|  3892|        12.5|   72|    US|     117|  TEXAS|
|    AMC Matador (sw)|14.0|        8|       304.0|       150|  4257|        15.5|   74|    US|     185|     OH|
|       AMC Rebel SST|16.0|        8|       304.0|       150|  3433|        12.0|   70|    US|       4| DALLAS|
|  AMC Rebel SST (sw)| 0.0|        8|       360.0|       175|  3850|        11.0|   70|    US|      53|  TEXAS|
|            BMW 2002|26.0|        4|       121.0|       113|  2234|        12.5|   70|Europe|      67| DALLAS|
|            BMW 320i|21.5|        4|       121.0|       110|  2600|        12.8|   77|Europe|     287|  TEXAS|
|       Buick Century|17.0|        6|       231.0|       110|  3907|        21.0|   75|    US|     205|     OH|
|       Buick Century|22.4|        6|       231.0|       110|  3415|        15.8|   81|    US|     409|NewYork|
|   Buick Century 350|13.0|        8|       350.0|       175|  4100|        13.0|   73|    US|     130|     NJ|
|Buick Century Lim...|25.0|        6|       181.0|       110|  2945|        16.4|   82|    US|     432| DALLAS|
|Buick Century Lux...|13.0|        8|       350.0|       150|  4699|        14.5|   74|    US|     182|  TEXAS|
+--------------------+----+---------+------------+----------+------+------------+-----+------+--------+-------+
only showing top 20 rows

Find the Sum of only Toyota Camrys and Dodge D200s

In [28]:
session.sql("""
SELECT 
    Car, 
    sum(quantity) 
FILTER (WHERE Car IN ('Toyota Camry', 'Datsun 200-SX')) AS `Filtered Results`
FROM temp_cars
GROUP BY Car
""").show(25)
# filter will only allow aggrigate functions to be applied 
# where Filter conditions are satisfied

+--------------------+----------------+
|                 Car|Filtered Results|
+--------------------+----------------+
|Chevrolete Chevel...|            null|
|Volkswagen 1131 D...|            null|
|Chevrolet Monte C...|            null|
|     Ford LTD Landau|            null|
|       Honda Prelude|            null|
|      Chevrolet Nova|            null|
|   Volkswagen Rabbit|            null|
|     Ford Torino 500|            null|
|        Toyota Camry|             153|
|         Audi 100 LS|            null|
|Plymouth Valiant ...|            null|
|Toyota Corolla Ma...|            null|
|Oldsmobile Cutlas...|            null|
|Fiat 124 Sport Coupe|            null|
|Chevrolet Caprice...|            null|
|     Volvo 145e (sw)|            null|
|            Audi Fox|            null|
|    Chevrolet Camaro|            null|
|       Dodge Aspen 6|            null|
|AMC Ambassador Br...|            null|
|    Pontiac Catalina|            null|
|       Ford Maverick|            null|
|      Chevrolet Vega|            null|
|   Plymouth Fury III|            null|
|       Datsun 200-SX|             318|
+--------------------+----------------+
only showing top 25 rows

Regular Expressions

In [32]:
session.sql("""
SELECT 
    Car,
    REGEXP_EXTRACT(Car, ' ([A-Za-z]+)\.') AS `Car title`
FROM temp_cars
""").show(10)
# Extracts anything that comes after a space, 
# followed by a group consisting of 1 or more chars, 
# followed by anything else outside of that 0 or more times.
# Example: 
# https://docs.data.world/documentation/sql/reference/functions/regexp_extract.html

+--------------------+----------+
|                 Car| Car title|
+--------------------+----------+
|AMC Ambassador Br...|Ambassador|
|  AMC Ambassador DPL|Ambassador|
|  AMC Ambassador SST|Ambassador|
|         AMC Concord|    Concor|
|         AMC Concord|    Concor|
|     AMC Concord d/l|   Concord|
|      AMC Concord DL|   Concord|
|    AMC Concord DL 6|   Concord|
|         AMC Gremlin|    Gremli|
|         AMC Gremlin|    Gremli|
+--------------------+----------+
only showing top 10 rows